In [6]:
# Import Pandas
import pandas as pd
import matplotlib.pyplot as plt
from config import user, pw

# SQL ALchemy import
from sqlalchemy import create_engine

# Create engine for database
engine = create_engine(f'postgresql://{user}:{pw}@localhost:5432/Employee_SQL')
connection = engine.connect()

# Import employees table
employees = pd.read_sql("SELECT * FROM employees",connection)
employees.head()

   emp_no emp_title  birth_date  first_name  last_name sex   hire_date
0  473302     s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053     e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444     e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786     s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238     e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [7]:
# Import salaries table
salaries = pd.read_sql("SELECT * FROM salaries", connection)
salaries.head()

   emp_no   salary
0   10001  60117.0
1   10002  65828.0
2   10003  40006.0
3   10004  40054.0
4   10005  78228.0

In [16]:
# Import titles table
titles = pd.read_sql("SELECT * FROM titles", connection)
titles.head(10)

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager
7    s0001               Staff
8    s0002        Senior Staff
9    e0001  Assistant Engineer

In [14]:
# Import department table
department = pd.read_sql("SELECT * FROM departments", connection)
department.head()

  dept_no        dept_name
0    d001        Marketing
1    d002          Finance
2    d003  Human Resources
3    d004       Production
4    d005      Development

### I was not able to complete the bonus because the data for the employee titles was not consistent